;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

(package! aggressive-indent :disable t)
(package! clj-refactor)
(package! emojify)
(package! lsp-mode)
(package! lsp-ui)
(package! lsp-treemacs)
(package! paredit)
(package! posframe)
(package! sort-words)
